Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/svd/PIC32CZ4010CA91144.svd
            <register>
               <name>PID2</name>
               <description>DWT Peripheral Identification Register 2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000B</resetValue>
               <fields>
                  <field>
                     <name>DES_1</name>
                     <description>JEP106 identification code bits[6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>JEDEC assignee value is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Component revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID3</name>
               <description>DWT Peripheral Identification Register 3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Customer Modified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>RevAnd</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID0</name>
               <description>DWT Component Identification Register 0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_0</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID1</name>
               <description>DWT Component Identification Register 1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000E0</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_1</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLASS</name>
                     <description>CoreSight component class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID2</name>
               <description>DWT Component Identification Register 2</description>
               <addressOffset>0xFF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_2</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID3</name>
               <description>DWT Component Identification Register 3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_3</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>EIC</name>
         <version>037061b0</version>
         <description>External Interrupt Controller</description>
         <baseAddress>0x44800000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>EIC_EXTINT_0</name>
            <description>External Interrupt 0</description>
            <value>19</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_1</name>
            <description>External Interrupt 1</description>
            <value>20</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_2</name>
            <description>External Interrupt 2</description>
            <value>21</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_3</name>
            <description>External Interrupt 3</description>
            <value>22</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_4</name>
            <description>External Interrupt 4</description>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_5</name>
            <description>External Interrupt 5</description>
            <value>24</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_6</name>
            <description>External Interrupt 6</description>
            <value>25</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_7</name>
            <description>External Interrupt 7</description>
            <value>26</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_8</name>
            <description>External Interrupt 8</description>
            <value>27</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_9</name>
            <description>External Interrupt 9</description>
            <value>28</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_10</name>
            <description>External Interrupt 10</description>
            <value>29</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_11</name>
            <description>External Interrupt 11</description>
            <value>30</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_12</name>
            <description>External Interrupt 12</description>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_13</name>
            <description>External Interrupt 13</description>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_14</name>
            <description>External Interrupt 14</description>
            <value>33</value>
         </interrupt>
         <interrupt>
            <name>EIC_EXTINT_15</name>
            <description>External Interrupt 15</description>
            <value>34</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKSEL</name>
                     <description>Clock Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CKSELSelect</name>
                        <enumeratedValue>
                           <name>CLK_GCLK</name>
                           <description>Clocked by GCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLK_ULP32K</name>
                           <description>Clocked by ULP32K</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICTRL</name>
               <description>Non-Maskable Interrupt Control</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>NMISENSE</name>
                     <description>Non-Maskable Interrupt Sense Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>NMISENSESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No detection</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Rising-edge detection</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Falling-edge detection</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Both-edges detection</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High-level detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low-level detection</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMIFILTEN</name>
                     <description>Non-Maskable Interrupt Filter Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMIASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NMIASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIFLAG</name>
               <description>Non-Maskable Interrupt Flag Status and Clear</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>NMI</name>
                     <description>Non-Maskable Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Synchronization Busy Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINTEO</name>
                     <description>External Interrupt Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ASYNCH</name>
               <description>External Interrupt Asynchronous Mode</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASYNCH</name>
                     <description>Asynchronous Edge Detection Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <name>ASYNCHSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Edge detection is clock synchronously operated</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>Edge detection is clock asynchronously operated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
